In [1]:
import pandas as pd

In [2]:
a =['a','b','c','d']

prod_a=pd.Series(a)
prod_a

0    a
1    b
2    c
3    d
dtype: object

In [3]:
prod_series=pd.Series([12,34,56,7,8,90])
print(prod_series, type(prod_series))

0    12
1    34
2    56
3     7
4     8
5    90
dtype: int64 <class 'pandas.core.series.Series'>

In [4]:
import numpy as np
aa=np.array(a)
print(aa)
print(type(aa))
bb=(pd.Series(aa))
print(list(enumerate(aa)))

['a' 'b' 'c' 'd']
<class 'numpy.ndarray'>
[(0, 'a'), (1, 'b'), (2, 'c'), (3, 'd')]

In [5]:
#some methods

bb.head(2)
bb.tail(2)
bb.sum()
bb.min()

'a'

In [6]:
bb.describe() #to obtain descriptive stats of the object

count     4
unique    4
top       a
freq      1
dtype: object

In [7]:
cc=bb.copy() # to copy such that what is done to cc does not affect bb
print(len(cc))
print(cc.unique())

4
['a' 'b' 'c' 'd']

In [8]:
numbers = pd.Series([15, 1000, 25, 49, 444])
numbers.sort_values()

0      15
2      25
3      49
4     444
1    1000
dtype: int64

In [9]:
import os
os.getcwd()

'C:\\Users\\HP\\Desktop\\Regression_Udemy'

In [10]:
dt=pd.read_csv('C:\\Users\\HP\\Downloads\\Location.csv',squeeze=True)
data=dt.copy()
data.sort_values()

637     Location 1
884     Location 1
465     Location 1
716    Location 10
623    Location 10
          ...
482    Location 97
128    Location 97
669    Location 97
757    Location 98
372    Location 99
Name: Location, Length: 1043, dtype: object

In [11]:
array_a=np.array([[1,2,3],[3,2,6]])
array_a

array([[1, 2, 3],
       [3, 2, 6]])

In [12]:
pdd=pd.DataFrame(array_a, columns=['c1','c2','c3'], index=['r1','r2'])
pdd

    c1  c2  c3
r1   1   2   3
r2   3   2   6

In [13]:
dt=pd.read_csv('C:\\Users\\HP\\Downloads\\Lending-company.csv')
data=dt.copy()
data.head()
data.index
data.columns
data.dtypes

LoanID              int64
StringID           object
Product            object
CustomerGender     object
Location           object
Region             object
TotalPrice        float64
StartDate          object
Deposit             int64
DailyRate           int64
TotalDaysYr         int64
AmtPaid36           int64
AmtPaid60           int64
AmtPaid360          int64
LoanStatus         object
dtype: object

In [14]:
data.values

array([[1, 'LoanID_1', 'Product B', ..., 4166, 14621, 'Active'],
       [2, 'LoanID_2', 'Product D', ..., 4096, 16041, 'Active'],
       [3, 'LoanID_3', 'Product B', ..., 3205, 16340, nan],
       ...,
       [1041, 'LoanID_1041', 'Product A', ..., 5143, 16617,
        'Finished Payment'],
       [1042, 'LoanID_1042', 'Product B', ..., 3462, 15617,
        'Finished Payment'],
       [1043, 'LoanID_1043', 'Product A', ..., 4743, 16617,
        'Finished Payment']], dtype=object)

In [15]:
data.shape

(1043, 15)

In [16]:
dt2=pd.read_csv('C:\\Users\\HP\\Downloads\\Lending-company.csv',index_col='StringID')
data2=dt2.copy()
data.head()

,LoanID,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
0,1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
1,2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
2,3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
3,4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
4,5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [17]:
data2.Product

StringID
LoanID_1       Product B
LoanID_2       Product D
LoanID_3       Product B
LoanID_4       Product A
LoanID_5       Product B
                 ...
LoanID_1039    Product B
LoanID_1040    Product A
LoanID_1041    Product A
LoanID_1042    Product B
LoanID_1043    Product A
Name: Product, Length: 1043, dtype: object

In [37]:
data2[['Product']]

               Product
StringID
LoanID_1     Product B
LoanID_2     Product D
LoanID_3     Product B
LoanID_4     Product A
LoanID_5     Product B
...                ...
LoanID_1039  Product B
LoanID_1040  Product A
LoanID_1041  Product A
LoanID_1042  Product B
LoanID_1043  Product A

[1043 rows x 1 columns]

In [32]:
aa=np.array(data2[['Product']])
len(np.unique(aa))

6

In [40]:
data2.iloc[2:8,5:8]

          TotalPrice   StartDate  Deposit
StringID
LoanID_3     16600.0  08/12/2016     1000
LoanID_4     17600.0         NaN     2200
LoanID_5     21250.0  28/10/2017     2200
LoanID_6         NaN  19/04/2019     2200
LoanID_7     21250.0  04/07/2020     2200
LoanID_8     17600.0  24/04/2018     2200

In [41]:
type(data2)

pandas.core.frame.DataFrame

In [43]:
data2.iloc[[1,3,6,8],[0,1,2,3,4,5,6,7,8,9,10]]

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36
StringID,,,,,,,,,,,
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141
LoanID_7,7,Product A,Male,Location 25,NaN,21250.0,04/07/2020,2200,55,365,1951
LoanID_9,9,Product A,Male,Location 156,Region 6,23250.0,03/09/2019,5000,55,365,5850

In [52]:
data2.loc[['LoanID_4','LoanID_6'],['Location','Region']]

             Location    Region
StringID
LoanID_4  Location 26  Region 2
LoanID_6  Location 34  Region 1

In [53]:
data2.loc[:,['Location','Region']]

                Location    Region
StringID
LoanID_1      Location 3  Region 2
LoanID_2      Location 6  Region 6
LoanID_3      Location 8  Region 3
LoanID_4     Location 26  Region 2
LoanID_5     Location 34  Region 3
...                  ...       ...
LoanID_1039  Location 73  Region 6
LoanID_1040  Location 82  Region 1
LoanID_1041  Location 11  Region 4
LoanID_1042  Location 26  Region 6
LoanID_1043  Location 94  Region 6

[1043 rows x 2 columns]